# MeasurementValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointLocationOnCurve..::..MeasurementValue Property
PointLocationOnCurve Class See Also
---
The measurement value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double MeasurementValue { get; set; }
```

Visual Basic
---
```text
Public Property MeasurementValue As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MeasurementValue {
	double get ();
	void set (double value);
}
```

# Remarks
The measurement value is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measurement value must match the expected range for the curve for the given measurement type and measure-from.
# See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace